Tekla.Structures.Drawing.Bolt.Representation
The bolt representations.

Tekla.Structures.Drawing.Bolt.Representation.Solid
The solid representation.

Tekla.Structures.Drawing.Bolt.Representation.ExactSolid
The exact solid representation.

Tekla.Structures.Drawing.Bolt.Representation.Symbol
The symbol representation.

Tekla.Structures.Drawing.Bolt.Representation.Symbol2
The second symbol representation.

Tekla.Structures.Drawing.Bolt.Representation.Symbol3
The third symbol representation.

Tekla.Structures.Drawing.Bolt.Representation.DINSymbol
The DIN symbol representation.

Tekla.Structures.Drawing.Bolt.Representation.UserDefined
The user defined representation.